In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
hero_file = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(hero_file)

In [2]:
## 1. Player Count

In [3]:
#Display the total number of players
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
#Display the total number of players
players =purchase_data_df["SN"].value_counts()
players

Lisosia93      5
Idastidru52    4
Iral74         4
Umolrian85     3
Iri67          3
              ..
Tyeurith29     1
Yadam35        1
Aeralria27     1
Yalo85         1
Aillyrin83     1
Name: SN, Length: 576, dtype: int64

In [5]:
total_player_2= len(players)
total_player_2

576

In [6]:
#Display the total number of players
player_count_df= pd.DataFrame({"Total Players":[total_player_2]})
player_count_df

   Total Players
0            576

In [7]:
##2. Purchasing Analysis

In [8]:
#Purchasing analysis
#Run basic calculations to obtain number of unique items, average price, etc.
#Display the summary data frame
purchase_data_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [9]:
total_revenue= purchase_data_df["Price"].sum()
total_revenue

2379.77

In [10]:
number_of_unique_items= len(purchase_data_df["Item ID"].value_counts())
number_of_unique_items

183

In [11]:
total_purchases=purchase_data_df["Purchase ID"].value_counts()
total_purchases

779    1
243    1
265    1
264    1
263    1
      ..
517    1
516    1
515    1
514    1
0      1
Name: Purchase ID, Length: 780, dtype: int64

In [12]:
number_of_purchases=total_purchases.sum()
number_of_purchases

780

In [13]:
ave_price= purchase_data_df["Price"].mean()

In [14]:
f"{ave_price:.3}"

'3.05'

In [15]:
#Purchasing analysis
#Run basic calculations to obtain number of unique items, average price, etc.
#Display the summary data frame
total_purchasing_analysis_df = pd.DataFrame({"Number of Unique Items":[number_of_unique_items],
                                              "Average Price":[ave_price],
                                              "Number of Purchases":[number_of_purchases],
                                              "Total Revenue":[total_revenue]})
total_purchasing_analysis_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

In [16]:
##3. Gender Demographics

In [17]:
#Percentage and Count of Male Players
#Percentage and Count of Female Players
#Percentage and Count of Other / Non-Disclosed
gender_count = purchase_data_df["Gender"].value_counts()
gender_count.head()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [18]:
male_count= gender_count["Male"]
male_count

652

In [19]:
female_count = gender_count["Female"]
female_count

113

In [20]:
Others_count = gender_count["Other / Non-Disclosed"]
Others_count

15

In [21]:
total_gender_count = gender_count.sum()
total_gender_count

780

In [22]:
percentage = gender_count/total_gender_count 
percentage = percentage.map(lambda x : f"{(x*100):.4}%")
percentage

Male                     83.59%
Female                   14.49%
Other / Non-Disclosed    1.923%
Name: Gender, dtype: object

In [23]:
gender_demographics_df = pd.DataFrame({"Total Count": gender_count, 
                                       "Percentage of players":percentage})
gender_demographics_df.head()

                       Total Count Percentage of players
Male                           652                83.59%
Female                         113                14.49%
Other / Non-Disclosed           15                1.923%

In [24]:
##4. Purchasing Analysis (Gender)

In [25]:
#Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender
#Create a summary data frame to hold the results
#Optional: give the displayed data cleaner formatting
# Display the summary data frame

In [26]:
purchase_data_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [35]:
gender_pur_count = purchase_data_df.groupby('Gender')['Purchase ID']
gender_count = gender_pur_count.count()
gender_count_m = gender_count['Male']
gender_count_f = gender_count['Female']
gender_count_o = gender_count['Other / Non-Disclosed']
gender_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [36]:
gender_pur_price = purchase_data_df.groupby('Gender')['Price']
purchase_sum = gender_pur_price.sum()
purchase_sum_m = purchase_sum["Male"]
purchase_sum_f = purchase_sum["Female"]
purchase_sum_o = purchase_sum["Other / Non-Disclosed"]
purchase_sum

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [29]:
gender_pur_count = purchase_data_df.groupby('Gender')['Purchase ID']
gender_count = gender_pur_count.count()
gender_count_m = gender_count['Male']
gender_count_f = gender_count['Female']
gender_count_o = gender_count['Other / Non-Disclosed']

gender_pur_price = purchase_data_df.groupby('Gender')['Price']
purchase_sum = gender_pur_price.sum()
purchase_sum_m = purchase_sum["Male"]
purchase_sum_f = purchase_sum["Female"]
purchase_sum_o = purchase_sum["Other / Non-Disclosed"]


purchase_mean = gender_pur_price.mean()
purchase_mean_m = purchase_mean['Male']
purchase_mean_f = purchase_mean["Female"]
purchase_mean_o = purchase_mean["Other / Non-Disclosed"]

avg_purchase_price_m = purchase_sum_m / male_count
avg_purchase_price_f = purchase_sum_f / female_count
avg_purchase_price_o = purchase_sum_o / Others_count

gender_purchase_analysis = pd.DataFrame({
    'Gender':['Male','Female','Other Non-Disclosed'],
    'Purchase Count':[gender_count_m,gender_count_f,gender_count_o],
    'Average Purchase Price':[purchase_mean_m,purchase_mean_f,purchase_mean_o],
    'Total Purchase Value':[purchase_sum_m,purchase_sum_f,purchase_sum_o],
    'Avg Total Purchase per Person': [avg_purchase_price_m,avg_purchase_price_f,avg_purchase_price_o]})
gender_purchase_analysis['Average Purchase Price'] = gender_purchase_analysis['Average Purchase Price'].map("{:.2f}".format)
gender_purchase_analysis['Total Purchase Value'] = gender_purchase_analysis['Total Purchase Value'].map("${:.2f}".format)
gender_purchase_analysis['Avg Total Purchase per Person'] = gender_purchase_analysis['Avg Total Purchase per Person'].map("${:.2f}".format)

gender_purchase_analysis.set_index('Gender',inplace=True)
del gender_purchase_analysis.index.name
gender_purchase_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Male,652,3.02,$1967.64,$3.02
Female,113,3.20,$361.94,$3.20
Other Non-Disclosed,15,3.35,$50.19,$3.35

In [30]:
avg_purchase_price_gender_df= purchase_data_df.set_index("Gender")
avg_purchase_price_gender_df.head()

,Purchase ID,SN,Age,Item ID,Item Name,Price
Gender,,,,,,
Male,0,Lisim78,20,108,"Extraction, Quickblade Of Trembling Hands",3.53
Male,1,Lisovynya38,40,143,Frenzied Scimitar,1.56
Male,2,Ithergue48,24,92,Final Critic,4.88
Male,3,Chamassasya86,24,100,Blindscythe,3.27
Male,4,Iskosia90,23,131,Fury,1.44

In [31]:
df = avg_purchase_price_gender_df.loc[:,["Price"]].head()
df

        Price
Gender
Male     3.53
Male     1.56
Male     4.88
Male     3.27
Male     1.44

In [33]:
clean_df.head()

        Price
Gender
Male     3.53
Male     1.56
Male     4.88
Male     3.27
Male     1.44

In [ ]:
## 5. Age Demographics

In [ ]:
# Establish bins for ages
#Categorize the existing players using the age bins. Hint: use pd.cut()
#Calculate the numbers and percentages by age group
#Create a summary data frame to hold the results
#Optional: round the percentage column to two decimal points
#Display Age Demographics Table

In [42]:
# Establish bins for ages
bins =[0,9,14.9,19.9, 24.9, 29.9, 34.9, 39.9, 100 ]
group_labels = ["<10", "10 - 14", "15 - 19", "20 - 24", "25 - 29", "30 - 34","35 - 39", "40+"]

#Categorize the existing players using the age bins. Hint: use pd.cut()
Ageanalysis_df = pd.DataFrame(purchase_data_df)
Ageanalysis_df["Age Group"] = pd.cut(Ageanalysis_df["Age"], bins, labels=group_labels)
# Create a GroupBy object based upon "View Group"
Ageanalysis_df = Ageanalysis_df.groupby("Age Group")['SN']

# Find how many rows fall into each bin
players_cnts = Ageanalysis_df.nunique()
player_perc = (players_cnts/total_player_2)*100
Demographics_sum = pd.DataFrame({
        'Total Count':players_cnts,
        'Percentage of Players':player_perc
})

# Get the average of each column within the GroupBy object
Demographics_sum['Percentage of Players'] = Demographics_sum['Percentage of Players'].map( "{:.2f}%".format)

# Delete index name to improve formatting
del Demographics_sum.index.name
Demographics_sum

         Total Count Percentage of Players
<10               17                 2.95%
10 - 14           22                 3.82%
15 - 19          107                18.58%
20 - 24          258                44.79%
25 - 29           77                13.37%
30 - 34           52                 9.03%
35 - 39           31                 5.38%
40+               12                 2.08%

In [ ]:
#map(lambda x : f"{(x*100):.4}%")(just note)

In [ ]:
##6. Purchasing Analysis (Age)

In [ ]:
#Bin the purchase_data data frame by age
#Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below
#Create a summary data frame to hold the results
#Optional: give the displayed data cleaner formatting
#Display the summary data frame

In [45]:
age_purchase_df=pd.DataFrame(purchase_data_df)
age_purchase_df= age_purchase_df.groupby("Age Group")['Price'].agg(["count","mean","sum"])
age_purchase_df = pd.DataFrame(age_purchase_df)
age_purchase_df = age_purchase_df.rename(columns={'count':'Puchase Count',
                                                  'mean':'Average Purchase Price',
                                                  'sum':'Total Purchase Value'})
age_purchase_df['Average Purchase Price'] = age_purchase_df['Average Purchase Price'].map("${:.2f}".format)
age_purchase_df['Total Purchase Value'] = age_purchase_df['Total Purchase Value'].map("${:.2f}".format)
del age_purchase_df.index.name
age_purchase_df

         Puchase Count Average Purchase Price Total Purchase Value
<10                 23                  $3.35               $77.13
10 - 14             28                  $2.96               $82.78
15 - 19            136                  $3.04              $412.89
20 - 24            365                  $3.05             $1114.06
25 - 29            101                  $2.90              $293.00
30 - 34             73                  $2.93              $214.00
35 - 39             41                  $3.60              $147.67
40+                 13                  $2.94               $38.24

In [ ]:
##7. Top Spenders

In [ ]:
#Run basic calculations to obtain the results in the table below
#Create a summary data frame to hold the results
#Sort the total purchase value column in descending order
#Optional: give the displayed data cleaner formatting
#Display a preview of the summary data frame

In [70]:
TopSpenders_df =purchase_data_df.groupby('SN')['Price'].agg(["count","mean","sum"])
TopSpenders_df_2 = pd.DataFrame(TopSpenders_df)
TopSoenders_df_2 = TopSpenders_df_2.rename(columns = {'count':'Puchase Count',
                                                      'mean':'Average Purchase Price',
                                                      'sum':'Total Purchase Value'})

TopSoenders_df_2.head()

              Puchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76              1                    2.28                  2.28
Adastirin33               1                    4.48                  4.48
Aeda94                    1                    4.91                  4.91
Aela59                    1                    4.32                  4.32
Aelaria33                 1                    1.79                  1.79

In [67]:
TopSpenders_df =purchase_data_df.groupby('SN')['Price'].agg(["count","mean","sum"])
TopSpenders_df_2 = pd.DataFrame(TopSpenders_df)
TopSpenders_df_2 = TopSpenders_df_2.rename(columns = {'count':'Puchase Count',
                                                      'mean':'Average Purchase Price',
                                                      'sum':'Total Purchase Value'})

TopSpenders_df_2['Total Purchase Value'] = TopSpenders_df_2['Total Purchase Value'].map("${:.2f}".format)
TopSpenders_df_2['Average Pruchase Price'] = TopSpenders_df_2['Average Purchase Price'].map("${:.2f}".format)


TopSpenders_df_2.head()

,Puchase Count,Average Purchase Price,Total Purchase Value,Average Pruchase Price
SN,,,,
Adairialis76,1,2.28,$2.28,$2.28
Adastirin33,1,4.48,$4.48,$4.48
Aeda94,1,4.91,$4.91,$4.91
Aela59,1,4.32,$4.32,$4.32
Aelaria33,1,1.79,$1.79,$1.79

In [75]:
TopSpenders_df =purchase_data_df.groupby('SN')['Price'].agg(["count","mean","sum"])
TopSpenders_df_2 = pd.DataFrame(TopSpenders_df)
TopSpenders_df_2 = TopSpenders_df_2.rename(columns = {'count':'Puchase Count',
                                                      'mean':'Average Purchase Price',
                                                      'sum':'Total Purchase Value'})

TopSpenders_df_2 = TopSpenders_df_2.sort_values('Total Purchase Value', ascending=False)
TopSpenders_df_2['Total Purchase Value'] = TopSpenders_df_2['Total Purchase Value'].map("${:.2f}".format)
TopSpenders_df_2['Average Purchase Price'] = TopSpenders_df_2['Average Purchase Price'].map("${:.2f}".format)


TopSpenders_df_2.head()

             Puchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                5                  $3.79               $18.96
Idastidru52              4                  $3.86               $15.45
Chamjask73               3                  $4.61               $13.83
Iral74                   4                  $3.40               $13.62
Iskadarya95              3                  $4.37               $13.10

In [62]:
TopSoenders_df_3= TopSoenders_df_2.sort_values(by = 'Total Purchase Value', ascending = False)
TopSoenders_df_3.head()

             Puchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                5                3.792000                 18.96
Idastidru52              4                3.862500                 15.45
Chamjask73               3                4.610000                 13.83
Iral74                   4                3.405000                 13.62
Iskadarya95              3                4.366667                 13.10
...                    ...                     ...                   ...
Ililsasya43              1                1.020000                  1.02
Irilis75                 1                1.020000                  1.02
Aidai61                  1                1.010000                  1.01
Chanirra79               1                1.010000                  1.01
Alo38                    1                1.000000                  1.00

[576 rows x 3 columns]

In [ ]:
sngroupby = purchase_data.groupby('SN')
snpurchasecountinfo = sngroupby['Price'].describe()
snpurchasecountdata = snpurchasecountinfo.reset_index()

first_summary_sn_data = snpurchasecountdata[["SN", "count", "mean"]]

snpurchasetotal = sngroupby['Price'].sum()
second_summary_sn_data = pd.merge(first_summary_sn_data, snpurchasetotal, on='SN')

second_summary_sn_data
second_summary_sn_data['mean'] = round(final_summary_sn_data['mean'],2)
second_summary_sn_data['count'] = (final_summary_sn_data['count'].astype(int))

third_summary_sn_data = second_summary_sn_data.sort_values(by='Price', ascending=False)
final_summary_sn_data = third_summary_sn_data.rename(columns={"count": "Purchase Count", 
                                                              "mean": "Average Purchase Price", "Price": "Total Purchase Value"})

final_summary_sn_data.head(5)

In [ ]:
##8. Most Popular Items

In [ ]:
#Retrieve the Item ID, Item Name, and Item Price columns
#Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value
#Create a summary data frame to hold the results
#Sort the purchase count column in descending order
#Optional: give the displayed data cleaner formatting
#Display a preview of the summary data frame

In [76]:
MostPopItems_df = purchase_data_df.groupby(['Item ID','Item Name','Price'])['Price'].agg(['count','sum'])
MostPopItems_df = MostPopItems_df.sort_values('count',ascending=False).reset_index()
MostPopItems_df = MostPopItems_df.set_index(['Item ID','Item Name'])

MostPopItems_df_2= MostPopItems_df.rename(columns = {'count':'Purchase Count',
                                           'sum':'Total Purchase Value',
                                           'Price': 'Item Price'})

MostPopItems_df_2['Item Price']=MostPopItems_df_2['Item Price'].map("${:.2f}".format)
MostPopItems_df_2['Total Purchase Value']=MostPopItems_df_2['Total Purchase Value'].map("${:.2f}".format)
                                                                                          
                                                                                          
MostPopItems_df_2.head()

,,Item Price,Purchase Count,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",$4.23,12,$50.76
145,Fiery Glass Crusader,$4.58,9,$41.22
108,"Extraction, Quickblade Of Trembling Hands",$3.53,9,$31.77
82,Nirvana,$4.90,9,$44.10
19,"Pursuit, Cudgel of Necromancy",$1.02,8,$8.16

In [ ]:
## 9. Most Profitable Items
# I dont know why the ascending= False didnt work

In [ ]:
#Sort the above table by total purchase value in descending order
#Optional: give the displayed data cleaner formatting
#Display a preview of the data frame

In [78]:
MostProfitableItems = MostPopItems_df_2.sort_values('Total Purchase Value',ascending=False)
MostProfitableItems.head(10)

,,Item Price,Purchase Count,Total Purchase Value
Item ID,Item Name,,,
63,Stormfury Mace,$4.99,2,$9.98
29,"Chaos, Ender of the End",$1.98,5,$9.90
173,Stormfury Longsword,$4.93,2,$9.86
1,Crucifer,$3.26,3,$9.78
38,"The Void, Vengeance of Dark Magic",$2.37,4,$9.48
143,Frenzied Scimitar,$1.56,6,$9.36
7,"Thorn, Satchel of Dark Souls",$1.33,7,$9.31
18,"Torchlight, Bond of Storms",$4.65,2,$9.30
129,"Fate, Vengeance of Eternal Justice",$1.54,6,$9.24
166,Thirsty Iron Reaver,$3.07,3,$9.21

In [55]:
MostProfitableItems = MostPopItems_df.sort_values('Total Purchase Value',ascending=False)
MostProfitableItems.head()

,,Item Price,Purchase Count,Total Purchase Value
Item ID,Item Name,,,
63,Stormfury Mace,$4.99,2,$9.98
29,"Chaos, Ender of the End",$1.98,5,$9.90
173,Stormfury Longsword,$4.93,2,$9.86
1,Crucifer,$3.26,3,$9.78
38,"The Void, Vengeance of Dark Magic",$2.37,4,$9.48